app/Http/Controllers/Tenant/Operative/Calendar/CalendarController.php

    public function config_date(Request $request)
    {
        $validator = Validator::make( $request->all(), [
            'date-duration' => ['required', 'integer'],
            'date-after' => ['required', 'integer']
        ]);

        if ($validator->failed())
        {
            return response(['error' => $validator->errors()->all()], Response::HTTP_NOT_FOUND);
        }

        //user
        $user = Auth::user();

        //Update date
        $user->calendar_config->date_duration = $request->get('date-duration');
        $user->calendar_config->date_interval = $request->get('date-after');
        $user->calendar_config->save();
---
select * from `calendar_config` where `calendar_config`.`user_id` = 1 and `calendar_config`.`user_id` is not null limit 1
update `calendar_config` set `date_duration` = '60', `date_interval` = '10', `calendar_config`.`updated_at` = '2021-11-08 19:49:08' where `id` = 1

        }


        $user->calendar_config->save();
---
update `calendar_config` set `schedule_on` = '[{\"id\":1636400952,\"startTime\":\"08:00\",\"endTime\":\"12:00\",\"daysOfWeek\":[\"1\",\"3\",\"5\"]}]', `calendar_config`.`updated_at` = '2021-11-08 19:49:12' where `id` = 1